'''
Дано вещественное число – цена 1 кг конфет. Вывести стоимость 1, 2, ... 10 кг конфет.
Решить задачу используя циклическую конструкцию for.

c = int(input())
for i in range(10):
    print('Цена конфет - ', (i+1)*c, 'единиц за', (i+1), "кг")

Дана непустая последовательность целых чисел, оканчивающаяся нулем. 
Найти: а) сумму всех чисел последовательности; 
б) количество всех чисел последовательности.
Решить задачу используя циклическую конструкцию while.

a = int(input())
total = 0
total_2 = 0
while a != 0:
    total += a
    total_2 += 1
    a = int(input())
print(total, '- сумма чисел', total_2, '- количесвто')

Найдите сумму всех элементов списка [1, '2', 3, 4, '5'], предварительно приводя строки к целым числам.

s = [1, '2', 3, 4, '5']
total = 0
for i in range(len(s)):
    b = int(s[i])
    total += b
print(total)


n, m = int(input()), int(input())
if n != 0:
    print('@'*m)
    for i in range(n-2):
        print('@', " "*(m-2), '@', sep='')
    print('@'*m)

'''



a = list('абвгдежзийклмнопрстуфхцчшщъыьэюя   ')
for i in range(7):
    print('--------------------\n|' if i == 0 else '|', a[i].upper(), a[i], '|', '|', a[i + 1].upper(), a[i + 1], '|', '|', a[i + 2].upper(), 
              a[i + 2], '|', '|', a[i + 3].upper(), a[i + 3], '|', '|', a[i + 4].upper(), a[i + 4], '|', sep='',
              end="\n--------------------\n")
    del a[i+1]
    del a[i+1]
    del a[i+1]
    del a[i+1]

